//  0. Вывести квадрат числа
Console.WriteLine("Введите число");
int Num= Convert.ToInt32(Console.ReadLine());
int Square= Num*Num;
Console.WriteLine(Square);

