// Даны два числа. Показать большее и меньшее число
int A=5;
int B=2;
if(A>B) Console.WriteLine($"Число {A} большее, а число {B} меньшее");
else Console.WriteLine($"Число {B} большее, а число {A} меньшее");
